import { Box, Container, Flex, Text } from "@chakra-ui/react";

const Conditions = () => {
  return (
    <div>
      <Container maxW="1440px">
        <Flex flexDirection="column" gap="7">
          <Box maxW="full" bg="white" borderRadius="30" paddingY="4">
            <Text fontSize="2xl" className="text-[20px] py-[6px] sm:py-[15px] px-[20px] sm:px-[30px]">
              Условия сервиса
            </Text>

            <Text className="text-[18px] py-4 sm:py-6 px-4 sm:px-[44px]">
              Задача организации, в особенности же курс на
              социально-ориентированный национальный проект требует от нас
              системного анализа модели развития! Таким образом, постоянное
              информационно-техническое обеспечение нашей деятельности требует
              от нас анализа системы масштабного изменения ряда параметров! С
              другой стороны социально-экономическое развитие напрямую зависит
              от всесторонне сбалансированных нововведений?
            </Text>
          </Box>

          <Box maxW="full" bg="white" borderRadius="30" paddingY="4">
            <Text fontSize="2xl" className="text-[20px] py-[6px] sm:py-[15px] px-[20px] sm:px-[30px]">
              Условия сервиса
            </Text>

            <Text className="text-[18px] py-4 sm:py-6 px-4 sm:px-[44px]">
              Задача организации, в особенности же курс на
              социально-ориентированный национальный проект требует от нас
              системного анализа модели развития! Таким образом, постоянное
              информационно-техническое обеспечение нашей деятельности требует
              от нас анализа системы масштабного изменения ряда параметров! С
              другой стороны социально-экономическое развитие напрямую зависит
              от всесторонне сбалансированных нововведений?
            </Text>
          </Box>

          <Box maxW="full" bg="white" borderRadius="30" paddingY="4">
            <Text fontSize="2xl" className="text-[20px] py-[6px] sm:py-[15px] px-[20px] sm:px-[30px]">
              Условия сервиса
            </Text>

            <Text className="text-[18px] py-4 sm:py-6 px-4 sm:px-[44px]">
              Задача организации, в особенности же курс на
              социально-ориентированный национальный проект требует от нас
              системного анализа модели развития! Таким образом, постоянное
              информационно-техническое обеспечение нашей деятельности требует
              от нас анализа системы масштабного изменения ряда параметров! С
              другой стороны социально-экономическое развитие напрямую зависит
              от всесторонне сбалансированных нововведений?
            </Text>
          </Box>
        </Flex>
      </Container>
    </div>
  );
};

export default Conditions;
